const pattern = {
  // 中文
  cn: /^[\u4e00-\u9fa5]+$/,

  // 英文
  en: /^[a-zA-Z]+$/,

  // 中、英、数字
  cn_en_number: /^[\u4e00-\u9fa5a-zA-Z_0-9]+$/,

  // 中、英
  cn_en: /^[\u4e00-\u9fa5a-zA-Z]+$/,

  // 中、数字
  cn_number: /^[\u4e00-\u9fa50-9]+$/,

  // 英、数字
  en_number: /^[a-zA-Z0-9]+$/,

  // 整数
  int: /^-?[1-9]\d*$/,

  // 正整数
  p_int: /^[1-9]\d*$/,

  // 负整数
  n_int: /^-[1-9]\d*$/,

  // 自然数
  natural_int: /^[0-9]\d*$/,

  en_name: /^[a-zA-Z_]+$/,

  //手机
  phone: /^1[3456789]\d{9}$/,

  //身份证
  idNo: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,

  //密码
  password: /^(?![0-9]+$)(?![a-zA-Z]+$)[0-9A-Za-z]{6,26}$/,

  // 是否全是空字符
  isEmpty: /^[\s]*$/,
};

export default pattern;
